<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"7c015595d962e57b20efc96b175bb5989675d6d97745093127a7548264e99cad","plan_job_ref":"Job Test terraform-refresh #76 at https://github.com/dflook/terraform-github-actions/actions/runs/20957047958","plan_out_hash":"2f5be147e3b6ddccf9f012fe3d550b2b7be7384eaedacab87ac04e7a679bd4dd","plan_hash":"d6a3fc9cfa268c051a4f1acfcf5c7a3a8f881ec9c7bae4b029bb4ffa13b95824","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test terraform-refresh #76](https://github.com/dflook/terraform-github-actions/actions/runs/20957047958)